IMSAssociation/IMSAssociationDeleteIMPU.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:hss="http://schemas.ericsson.com/ma/HSS/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <cai3:SessionId>${SessionId}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Set>
         <cai3:MOType>IMSAssociation@http://schemas.ericsson.com/ma/HSS/</cai3:MOType>
         <cai3:MOId>
            <hss:associationId>${subscriberId}</hss:associationId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <hss:SetIMSAssociation associationId="${subscriberId}">
               <hss:publicData publicIdValue="tel:+${e164}" xsi:nil="true"/>
            </hss:SetIMSAssociation>
         </cai3:MOAttributes>
      </cai3:Set>
   </soapenv:Body>
</soapenv:Envelope>